{
    "intents": [
        {
            "tag": "phòng ",
            "patterns": [
                "Có những loại phòng nào?"
            ],
            "responses": [
                "Phòng trọ rộng rãi",
                "Căn hộ mini hiện đại",
                "Phòng tiện nghi gần chợ",
                "Phòng trọ sinh viên tiện lợi",
                "Phòng studio tiện nghi",
                "Phòng tiện nghi cơ bản",
                "Phòng trọ hiện đại",
                "Phòng trọ tiện nghi",
                "Phòng trọ sinh viên",
                "Phòng trọ tiện nghi hiện đại",
                "Căn hộ dịch vụ sang trọng",
                "Căn hộ mini view đẹp",
                "Phòng trọ sinh viên tiện nghi",
                "Phòng mới tiện nghi",
                "Studio mới xây",
                "test"
            ]
        },
        {
            "tag": "Studio mới xây địa chỉ ở đâu",
            "patterns": [
                "Studio mới xây địa chỉ ở đâu?"
            ],
            "responses": [
                "Studio mới xây - Địa chỉ: Quận 1"
            ]
        },
        {
            "tag": "Phòng studio tiện nghi địa chỉ ở đâu",
            "patterns": [
                "Phòng studio tiện nghi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng studio tiện nghi - Địa chỉ: Phú Nhuận"
            ]
        },
        {
            "tag": "Căn hộ mini view đẹp địa chỉ ở đâu",
            "patterns": [
                "Căn hộ mini view đẹp địa chỉ ở đâu?"
            ],
            "responses": [
                "Căn hộ mini view đẹp - Địa chỉ: Quận 3"
            ]
        },
        {
            "tag": "Phòng trọ tiện nghi địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ tiện nghi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ tiện nghi - Địa chỉ: Quận 7",
                "Phòng trọ tiện nghi - Địa chỉ: Thủ Đức",
                "Phòng trọ tiện nghi - Địa chỉ: Bình Thạnh"
            ]
        },
        {
            "tag": "Căn hộ dịch vụ sang trọng địa chỉ ở đâu",
            "patterns": [
                "Căn hộ dịch vụ sang trọng địa chỉ ở đâu?"
            ],
            "responses": [
                "Căn hộ dịch vụ sang trọng - Địa chỉ: Tân Bình"
            ]
        },
        {
            "tag": "Phòng trọ sinh viên địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ sinh viên địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ sinh viên - Địa chỉ: Quận 7",
                "Phòng trọ sinh viên - Địa chỉ: Quận 10"
            ]
        },
        {
            "tag": "Căn hộ mini hiện đại địa chỉ ở đâu",
            "patterns": [
                "Căn hộ mini hiện đại địa chỉ ở đâu?"
            ],
            "responses": [
                "Căn hộ mini hiện đại - Địa chỉ: Phú Nhuận"
            ]
        },
        {
            "tag": "Phòng trọ sinh viên tiện lợi địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ sinh viên tiện lợi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện lợi - Địa chỉ: Quận 1",
                "Phòng trọ sinh viên tiện lợi - Địa chỉ: Quận 10"
            ]
        },
        {
            "tag": "Phòng tiện nghi gần chợ địa chỉ ở đâu",
            "patterns": [
                "Phòng tiện nghi gần chợ địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng tiện nghi gần chợ - Địa chỉ: Quận 2"
            ]
        },
        {
            "tag": "Phòng trọ hiện đại địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ hiện đại địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ hiện đại - Địa chỉ: Quận 3"
            ]
        },
        {
            "tag": "Phòng trọ sinh viên tiện nghi địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ sinh viên tiện nghi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện nghi - Địa chỉ: Quận 4"
            ]
        },
        {
            "tag": "Phòng trọ tiện nghi hiện đại địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ tiện nghi hiện đại địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ tiện nghi hiện đại - Địa chỉ: Quận 5"
            ]
        },
        {
            "tag": "Phòng trọ rộng rãi địa chỉ ở đâu",
            "patterns": [
                "Phòng trọ rộng rãi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ rộng rãi - Địa chỉ: Quận 6"
            ]
        },
        {
            "tag": "Phòng tiện nghi cơ bản địa chỉ ở đâu",
            "patterns": [
                "Phòng tiện nghi cơ bản địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng tiện nghi cơ bản - Địa chỉ: Quận 8"
            ]
        },
        {
            "tag": "Phòng mới tiện nghi địa chỉ ở đâu",
            "patterns": [
                "Phòng mới tiện nghi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng mới tiện nghi - Địa chỉ: Quận 9"
            ]
        },
        {
            "tag": "test địa chỉ ở đâu",
            "patterns": [
                "test địa chỉ ở đâu?"
            ],
            "responses": [
                "test - Địa chỉ: test"
            ]
        },
        {
            "tag": "Danh sách các loại phòng",
            "patterns": [
                "Có những loại phòng nào?",
                "Hãy cho tôi biết các loại phòng",
                "Danh sách các phòng hiện có",
                "Liệt kê tất cả các loại phòng"
            ],
            "responses": [
                "Phòng: 9",
                "Phòng: Phòng trọ sinh viên",
                "Phòng: Quang Cáo",
                "Phòng: Phòng tiện nghi gần chợ",
                "Phòng: Căn hộ Nguyễn Huệ",
                "Phòng: Căn hộ Sunrise City",
                "Phòng: Phòng trọ tiện nghi",
                "Phòng: Studio mới xây",
                "Phòng: Phòng trọ hiện đại",
                "Phòng: Căn hộ mini view đẹp",
                "Phòng: Căn hộ dịch vụ sang trọng",
                "Phòng: Phòng trọ Lê Văn Sỹ",
                "Phòng: Căn hộ Nguyễn Văn Linh",
                "Phòng: Phòng trọ Bến Nghé",
                "Phòng: Phòng trọ tiện nghi hiện đại",
                "Phòng: Phòng studio tiện nghi",
                "Phòng: Nhà Sư Vạn Hạnh",
                "Phòng: Phòng trọ sinh viên tiện nghi",
                "Phòng: tesst",
                "Phòng: Phòng tiện nghi cơ bản",
                "Phòng: Phòng mới tiện nghi",
                "Phòng: test",
                "Phòng: Phòng trọ Trần Hưng Đạo",
                "Phòng: Căn hộ mini hiện đại",
                "Phòng: Phòng trọ sinh viên tiện lợi",
                "Phòng: Phòng trọ rộng rãi",
                "Phòng: Phòng trọ Thảo Điền"
            ]
        },
        {
            "tag": "Địa chỉ phòng Studio mới xây",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Studio mới xây",
                "Địa chỉ của phòng Studio mới xây là gì?",
                "Studio mới xây địa chỉ ở đâu?"
            ],
            "responses": [
                "Studio mới xây - Địa chỉ: Quận 1"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng studio tiện nghi",
            "patterns": [
                "Phòng studio tiện nghi địa chỉ ở đâu?",
                "Địa chỉ của phòng Phòng studio tiện nghi là gì?",
                "Tôi muốn biết địa chỉ phòng Phòng studio tiện nghi"
            ],
            "responses": [
                "Phòng studio tiện nghi - Địa chỉ: Phú Nhuận"
            ]
        },
        {
            "tag": "Địa chỉ phòng Căn hộ mini view đẹp",
            "patterns": [
                "Địa chỉ của phòng Căn hộ mini view đẹp là gì?",
                "Tôi muốn biết địa chỉ phòng Căn hộ mini view đẹp",
                "Căn hộ mini view đẹp địa chỉ ở đâu?"
            ],
            "responses": [
                "Căn hộ mini view đẹp - Địa chỉ: Quận 3"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ tiện nghi",
            "patterns": [
                "Phòng trọ tiện nghi địa chỉ ở đâu?",
                "Địa chỉ của phòng Phòng trọ tiện nghi là gì?",
                "Tôi muốn biết địa chỉ phòng Phòng trọ tiện nghi"
            ],
            "responses": [
                "Phòng trọ tiện nghi - Địa chỉ: Thủ Đức",
                "Phòng trọ tiện nghi - Địa chỉ: Bình Thạnh",
                "Phòng trọ tiện nghi - Địa chỉ: Thành phố Thủ Đức",
                "Phòng trọ tiện nghi - Địa chỉ: Quận 7"
            ]
        },
        {
            "tag": "Địa chỉ phòng Căn hộ dịch vụ sang trọng",
            "patterns": [
                "Địa chỉ của phòng Căn hộ dịch vụ sang trọng là gì?",
                "Tôi muốn biết địa chỉ phòng Căn hộ dịch vụ sang trọng",
                "Căn hộ dịch vụ sang trọng địa chỉ ở đâu?"
            ],
            "responses": [
                "Căn hộ dịch vụ sang trọng - Địa chỉ: Tân Bình"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ sinh viên",
            "patterns": [
                "Địa chỉ của phòng Phòng trọ sinh viên là gì?",
                "Tôi muốn biết địa chỉ phòng Phòng trọ sinh viên",
                "Phòng trọ sinh viên địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ sinh viên - Địa chỉ: Quận 7",
                "Phòng trọ sinh viên - Địa chỉ: Quận 10"
            ]
        },
        {
            "tag": "Địa chỉ phòng Căn hộ mini hiện đại",
            "patterns": [
                "Căn hộ mini hiện đại địa chỉ ở đâu?",
                "Địa chỉ của phòng Căn hộ mini hiện đại là gì?",
                "Tôi muốn biết địa chỉ phòng Căn hộ mini hiện đại"
            ],
            "responses": [
                "Căn hộ mini hiện đại - Địa chỉ: Phú Nhuận"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ sinh viên tiện lợi",
            "patterns": [
                "Phòng trọ sinh viên tiện lợi địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng Phòng trọ sinh viên tiện lợi",
                "Địa chỉ của phòng Phòng trọ sinh viên tiện lợi là gì?"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện lợi - Địa chỉ: Quận 10",
                "Phòng trọ sinh viên tiện lợi - Địa chỉ: Quận 1"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng tiện nghi gần chợ",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng tiện nghi gần chợ",
                "Địa chỉ của phòng Phòng tiện nghi gần chợ là gì?",
                "Phòng tiện nghi gần chợ địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng tiện nghi gần chợ - Địa chỉ: Quận 2",
                "Phòng tiện nghi gần chợ - Địa chỉ: Thành phố Thủ Đức"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ hiện đại",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng trọ hiện đại",
                "Địa chỉ của phòng Phòng trọ hiện đại là gì?",
                "Phòng trọ hiện đại địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ hiện đại - Địa chỉ: Quận 3"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ sinh viên tiện nghi",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng trọ sinh viên tiện nghi",
                "Địa chỉ của phòng Phòng trọ sinh viên tiện nghi là gì?",
                "Phòng trọ sinh viên tiện nghi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện nghi - Địa chỉ: Quận 4"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ tiện nghi hiện đại",
            "patterns": [
                "Địa chỉ của phòng Phòng trọ tiện nghi hiện đại là gì?",
                "Tôi muốn biết địa chỉ phòng Phòng trọ tiện nghi hiện đại",
                "Phòng trọ tiện nghi hiện đại địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ tiện nghi hiện đại - Địa chỉ: Quận 5"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ rộng rãi",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng trọ rộng rãi",
                "Địa chỉ của phòng Phòng trọ rộng rãi là gì?",
                "Phòng trọ rộng rãi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ rộng rãi - Địa chỉ: Quận 6"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng tiện nghi cơ bản",
            "patterns": [
                "Phòng tiện nghi cơ bản địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng Phòng tiện nghi cơ bản",
                "Địa chỉ của phòng Phòng tiện nghi cơ bản là gì?"
            ],
            "responses": [
                "Phòng tiện nghi cơ bản - Địa chỉ: Quận 8"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng mới tiện nghi",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng mới tiện nghi",
                "Địa chỉ của phòng Phòng mới tiện nghi là gì?",
                "Phòng mới tiện nghi địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng mới tiện nghi - Địa chỉ: Quận 9",
                "Phòng mới tiện nghi - Địa chỉ: Thành phố Thủ Đức"
            ]
        },
        {
            "tag": "Địa chỉ phòng test",
            "patterns": [
                "test địa chỉ ở đâu?",
                "Địa chỉ của phòng test là gì?",
                "Tôi muốn biết địa chỉ phòng test"
            ],
            "responses": [
                "test - Địa chỉ: Thủ Đức",
                "test - Địa chỉ: test"
            ]
        },
        {
            "tag": "Trạng thái phòng Studio mới xây",
            "patterns": [
                "Phòng Studio mới xây có còn trống không?",
                "Trạng thái của phòng Studio mới xây",
                "Studio mới xây còn phòng không?"
            ],
            "responses": [
                "Studio mới xây - Trạng thái: active",
                "Studio mới xây - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng studio tiện nghi",
            "patterns": [
                "Phòng Phòng studio tiện nghi có còn trống không?",
                "Trạng thái của phòng Phòng studio tiện nghi",
                "Phòng studio tiện nghi còn phòng không?"
            ],
            "responses": [
                "Phòng studio tiện nghi - Trạng thái: ACTIVE",
                "Phòng studio tiện nghi - Trạng thái: pending",
                "Phòng studio tiện nghi - Trạng thái: active",
                "Phòng studio tiện nghi - Trạng thái: PENDING"
            ]
        },
        {
            "tag": "Trạng thái phòng Căn hộ mini view đẹp",
            "patterns": [
                "Căn hộ mini view đẹp còn phòng không?",
                "Trạng thái của phòng Căn hộ mini view đẹp",
                "Phòng Căn hộ mini view đẹp có còn trống không?"
            ],
            "responses": [
                "Căn hộ mini view đẹp - Trạng thái: ACTIVE",
                "Căn hộ mini view đẹp - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ tiện nghi",
            "patterns": [
                "Phòng trọ tiện nghi còn phòng không?",
                "Trạng thái của phòng Phòng trọ tiện nghi",
                "Phòng Phòng trọ tiện nghi có còn trống không?"
            ],
            "responses": [
                "Phòng trọ tiện nghi - Trạng thái: ACTIVE",
                "Phòng trọ tiện nghi - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Căn hộ dịch vụ sang trọng",
            "patterns": [
                "Trạng thái của phòng Căn hộ dịch vụ sang trọng",
                "Phòng Căn hộ dịch vụ sang trọng có còn trống không?",
                "Căn hộ dịch vụ sang trọng còn phòng không?"
            ],
            "responses": [
                "Căn hộ dịch vụ sang trọng - Trạng thái: ACTIVE",
                "Căn hộ dịch vụ sang trọng - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ sinh viên",
            "patterns": [
                "Trạng thái của phòng Phòng trọ sinh viên",
                "Phòng trọ sinh viên còn phòng không?",
                "Phòng Phòng trọ sinh viên có còn trống không?"
            ],
            "responses": [
                "Phòng trọ sinh viên - Trạng thái: ACTIVE",
                "Phòng trọ sinh viên - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Căn hộ mini hiện đại",
            "patterns": [
                "Phòng Căn hộ mini hiện đại có còn trống không?",
                "Trạng thái của phòng Căn hộ mini hiện đại",
                "Căn hộ mini hiện đại còn phòng không?"
            ],
            "responses": [
                "Căn hộ mini hiện đại - Trạng thái: active",
                "Căn hộ mini hiện đại - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ sinh viên tiện lợi",
            "patterns": [
                "Phòng Phòng trọ sinh viên tiện lợi có còn trống không?",
                "Phòng trọ sinh viên tiện lợi còn phòng không?",
                "Trạng thái của phòng Phòng trọ sinh viên tiện lợi"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện lợi - Trạng thái: ACTIVE",
                "Phòng trọ sinh viên tiện lợi - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng tiện nghi gần chợ",
            "patterns": [
                "Phòng Phòng tiện nghi gần chợ có còn trống không?",
                "Trạng thái của phòng Phòng tiện nghi gần chợ",
                "Phòng tiện nghi gần chợ còn phòng không?"
            ],
            "responses": [
                "Phòng tiện nghi gần chợ - Trạng thái: ACTIVE",
                "Phòng tiện nghi gần chợ - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ hiện đại",
            "patterns": [
                "Trạng thái của phòng Phòng trọ hiện đại",
                "Phòng Phòng trọ hiện đại có còn trống không?",
                "Phòng trọ hiện đại còn phòng không?"
            ],
            "responses": [
                "Phòng trọ hiện đại - Trạng thái: ACTIVE",
                "Phòng trọ hiện đại - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ sinh viên tiện nghi",
            "patterns": [
                "Phòng Phòng trọ sinh viên tiện nghi có còn trống không?",
                "Phòng trọ sinh viên tiện nghi còn phòng không?",
                "Trạng thái của phòng Phòng trọ sinh viên tiện nghi"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện nghi - Trạng thái: ACTIVE",
                "Phòng trọ sinh viên tiện nghi - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ tiện nghi hiện đại",
            "patterns": [
                "Phòng trọ tiện nghi hiện đại còn phòng không?",
                "Phòng Phòng trọ tiện nghi hiện đại có còn trống không?",
                "Trạng thái của phòng Phòng trọ tiện nghi hiện đại"
            ],
            "responses": [
                "Phòng trọ tiện nghi hiện đại - Trạng thái: ACTIVE",
                "Phòng trọ tiện nghi hiện đại - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ rộng rãi",
            "patterns": [
                "Trạng thái của phòng Phòng trọ rộng rãi",
                "Phòng Phòng trọ rộng rãi có còn trống không?",
                "Phòng trọ rộng rãi còn phòng không?"
            ],
            "responses": [
                "Phòng trọ rộng rãi - Trạng thái: active",
                "Phòng trọ rộng rãi - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng tiện nghi cơ bản",
            "patterns": [
                "Phòng Phòng tiện nghi cơ bản có còn trống không?",
                "Trạng thái của phòng Phòng tiện nghi cơ bản",
                "Phòng tiện nghi cơ bản còn phòng không?"
            ],
            "responses": [
                "Phòng tiện nghi cơ bản - Trạng thái: ACTIVE",
                "Phòng tiện nghi cơ bản - Trạng thái: active"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng mới tiện nghi",
            "patterns": [
                "Phòng Phòng mới tiện nghi có còn trống không?",
                "Phòng mới tiện nghi còn phòng không?",
                "Trạng thái của phòng Phòng mới tiện nghi"
            ],
            "responses": [
                "Phòng mới tiện nghi - Trạng thái: active",
                "Phòng mới tiện nghi - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng test",
            "patterns": [
                "Phòng test có còn trống không?",
                "test còn phòng không?",
                "Trạng thái của phòng test"
            ],
            "responses": [
                "test - Trạng thái: null",
                "test - Trạng thái: "
            ]
        },
        {
            "tag": "Diện tích phòng Studio mới xây",
            "patterns": [
                "Diện tích phòng Studio mới xây là bao nhiêu?",
                "Kích thước phòng Studio mới xây",
                "Studio mới xây diện tích như thế nào?"
            ],
            "responses": [
                "Studio mới xây - có chiều dài: 4.0m, chiều rộng: 5.0m, diện tích tổng: 25.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng studio tiện nghi",
            "patterns": [
                "Kích thước phòng Phòng studio tiện nghi",
                "Diện tích phòng Phòng studio tiện nghi là bao nhiêu?",
                "Phòng studio tiện nghi diện tích như thế nào?"
            ],
            "responses": [
                "Phòng studio tiện nghi - có chiều dài: 3.5m, chiều rộng: 6.0m, diện tích tổng: 30.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Căn hộ mini view đẹp",
            "patterns": [
                "Căn hộ mini view đẹp diện tích như thế nào?",
                "Diện tích phòng Căn hộ mini view đẹp là bao nhiêu?",
                "Kích thước phòng Căn hộ mini view đẹp"
            ],
            "responses": [
                "Căn hộ mini view đẹp - có chiều dài: 4.0m, chiều rộng: 4.5m, diện tích tổng: 28.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ tiện nghi",
            "patterns": [
                "Kích thước phòng Phòng trọ tiện nghi",
                "Phòng trọ tiện nghi diện tích như thế nào?",
                "Diện tích phòng Phòng trọ tiện nghi là bao nhiêu?"
            ],
            "responses": [
                "Phòng trọ tiện nghi - có chiều dài: 3.5m, chiều rộng: 4.7m, diện tích tổng: 24.0m²",
                "Phòng trọ tiện nghi - có chiều dài: 3.2m, chiều rộng: 4.0m, diện tích tổng: 18.0m²",
                "Phòng trọ tiện nghi - có chiều dài: 3.8m, chiều rộng: 4.8m, diện tích tổng: 24.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Căn hộ dịch vụ sang trọng",
            "patterns": [
                "Kích thước phòng Căn hộ dịch vụ sang trọng",
                "Diện tích phòng Căn hộ dịch vụ sang trọng là bao nhiêu?",
                "Căn hộ dịch vụ sang trọng diện tích như thế nào?"
            ],
            "responses": [
                "Căn hộ dịch vụ sang trọng - có chiều dài: 4.0m, chiều rộng: 6.0m, diện tích tổng: 35.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ sinh viên",
            "patterns": [
                "Phòng trọ sinh viên diện tích như thế nào?",
                "Diện tích phòng Phòng trọ sinh viên là bao nhiêu?",
                "Kích thước phòng Phòng trọ sinh viên"
            ],
            "responses": [
                "Phòng trọ sinh viên - có chiều dài: 3.0m, chiều rộng: 4.2m, diện tích tổng: 22.0m²",
                "Phòng trọ sinh viên - có chiều dài: 3.6m, chiều rộng: 5.2m, diện tích tổng: 32.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Căn hộ mini hiện đại",
            "patterns": [
                "Căn hộ mini hiện đại diện tích như thế nào?",
                "Kích thước phòng Căn hộ mini hiện đại",
                "Diện tích phòng Căn hộ mini hiện đại là bao nhiêu?"
            ],
            "responses": [
                "Căn hộ mini hiện đại - có chiều dài: 4.0m, chiều rộng: 5.5m, diện tích tổng: 30.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ sinh viên tiện lợi",
            "patterns": [
                "Phòng trọ sinh viên tiện lợi diện tích như thế nào?",
                "Kích thước phòng Phòng trọ sinh viên tiện lợi",
                "Diện tích phòng Phòng trọ sinh viên tiện lợi là bao nhiêu?"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện lợi - có chiều dài: 3.5m, chiều rộng: 4.5m, diện tích tổng: 23.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng tiện nghi gần chợ",
            "patterns": [
                "Phòng tiện nghi gần chợ diện tích như thế nào?",
                "Kích thước phòng Phòng tiện nghi gần chợ",
                "Diện tích phòng Phòng tiện nghi gần chợ là bao nhiêu?"
            ],
            "responses": [
                "Phòng tiện nghi gần chợ - có chiều dài: 3.0m, chiều rộng: 4.0m, diện tích tổng: 20.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ hiện đại",
            "patterns": [
                "Diện tích phòng Phòng trọ hiện đại là bao nhiêu?",
                "Phòng trọ hiện đại diện tích như thế nào?",
                "Kích thước phòng Phòng trọ hiện đại"
            ],
            "responses": [
                "Phòng trọ hiện đại - có chiều dài: 3.6m, chiều rộng: 4.8m, diện tích tổng: 25.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ sinh viên tiện nghi",
            "patterns": [
                "Kích thước phòng Phòng trọ sinh viên tiện nghi",
                "Diện tích phòng Phòng trọ sinh viên tiện nghi là bao nhiêu?",
                "Phòng trọ sinh viên tiện nghi diện tích như thế nào?"
            ],
            "responses": [
                "Phòng trọ sinh viên tiện nghi - có chiều dài: 3.8m, chiều rộng: 5.0m, diện tích tổng: 28.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ tiện nghi hiện đại",
            "patterns": [
                "Diện tích phòng Phòng trọ tiện nghi hiện đại là bao nhiêu?",
                "Kích thước phòng Phòng trọ tiện nghi hiện đại",
                "Phòng trọ tiện nghi hiện đại diện tích như thế nào?"
            ],
            "responses": [
                "Phòng trọ tiện nghi hiện đại - có chiều dài: 3.5m, chiều rộng: 4.6m, diện tích tổng: 22.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ rộng rãi",
            "patterns": [
                "Diện tích phòng Phòng trọ rộng rãi là bao nhiêu?",
                "Phòng trọ rộng rãi diện tích như thế nào?",
                "Kích thước phòng Phòng trọ rộng rãi"
            ],
            "responses": [
                "Phòng trọ rộng rãi - có chiều dài: 3.8m, chiều rộng: 5.0m, diện tích tổng: 30.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng tiện nghi cơ bản",
            "patterns": [
                "Diện tích phòng Phòng tiện nghi cơ bản là bao nhiêu?",
                "Phòng tiện nghi cơ bản diện tích như thế nào?",
                "Kích thước phòng Phòng tiện nghi cơ bản"
            ],
            "responses": [
                "Phòng tiện nghi cơ bản - có chiều dài: 3.2m, chiều rộng: 4.0m, diện tích tổng: 21.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng mới tiện nghi",
            "patterns": [
                "Phòng mới tiện nghi diện tích như thế nào?",
                "Diện tích phòng Phòng mới tiện nghi là bao nhiêu?",
                "Kích thước phòng Phòng mới tiện nghi"
            ],
            "responses": [
                "Phòng mới tiện nghi - có chiều dài: 3.7m, chiều rộng: 5.0m, diện tích tổng: 26.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng test",
            "patterns": [
                "Kích thước phòng test",
                "test diện tích như thế nào?",
                "Diện tích phòng test là bao nhiêu?"
            ],
            "responses": [
                "test - có chiều dài: 3.0m, chiều rộng: 3.0m, diện tích tổng: 9.0m²",
                "test - có chiều dài: 20.0m, chiều rộng: 20.0m, diện tích tổng: 20.0m²"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Studio mới xây",
            "patterns": [
                "Cho tôi thông tin chủ phòng Studio mới xây",
                "Ai là người quản lý phòng Studio mới xây?",
                "Thông tin liên lạc chủ phòng Studio mới xây"
            ],
            "responses": [
                "Phòng Studio mới xây do ông System làm đại diện. Số điện thoại: 0329615309",
                "Phòng Studio mới xây do ông System làm đại diện. Số điện thoại: 0329615399",
                "Phòng Studio mới xây do ông Việt Huỳnh làm đại diện. Số điện thoại: 0329615309"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng studio tiện nghi",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng studio tiện nghi",
                "Thông tin liên lạc chủ phòng Phòng studio tiện nghi",
                "Ai là người quản lý phòng Phòng studio tiện nghi?"
            ],
            "responses": [
                "Phòng Phòng studio tiện nghi do ông System làm đại diện. Số điện thoại: 0987654321",
                "Phòng Phòng studio tiện nghi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0987654321"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Căn hộ mini view đẹp",
            "patterns": [
                "Ai là người quản lý phòng Căn hộ mini view đẹp?",
                "Thông tin liên lạc chủ phòng Căn hộ mini view đẹp",
                "Cho tôi thông tin chủ phòng Căn hộ mini view đẹp"
            ],
            "responses": [
                "Phòng Căn hộ mini view đẹp do ông System làm đại diện. Số điện thoại: 0912345678",
                "Phòng Căn hộ mini view đẹp do ông Việt Huỳnh làm đại diện. Số điện thoại: 0912345678"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ tiện nghi",
            "patterns": [
                "Thông tin liên lạc chủ phòng Phòng trọ tiện nghi",
                "Ai là người quản lý phòng Phòng trọ tiện nghi?",
                "Cho tôi thông tin chủ phòng Phòng trọ tiện nghi"
            ],
            "responses": [
                "Phòng Phòng trọ tiện nghi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0908765432",
                "Phòng Phòng trọ tiện nghi do ông System làm đại diện. Số điện thoại: 0909876543",
                "Phòng Phòng trọ tiện nghi do ông System làm đại diện. Số điện thoại: 0909789012",
                "Phòng Phòng trọ tiện nghi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909876543",
                "Phòng Phòng trọ tiện nghi do ông System làm đại diện. Số điện thoại: 0908765432",
                "Phòng Phòng trọ tiện nghi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909789012"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Căn hộ dịch vụ sang trọng",
            "patterns": [
                "Ai là người quản lý phòng Căn hộ dịch vụ sang trọng?",
                "Cho tôi thông tin chủ phòng Căn hộ dịch vụ sang trọng",
                "Thông tin liên lạc chủ phòng Căn hộ dịch vụ sang trọng"
            ],
            "responses": [
                "Phòng Căn hộ dịch vụ sang trọng do ông Việt Huỳnh làm đại diện. Số điện thoại: 0938123456",
                "Phòng Căn hộ dịch vụ sang trọng do ông System làm đại diện. Số điện thoại: 0938123456"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ sinh viên",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng trọ sinh viên",
                "Thông tin liên lạc chủ phòng Phòng trọ sinh viên",
                "Ai là người quản lý phòng Phòng trọ sinh viên?"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên do ông System làm đại diện. Số điện thoại: 0909912345",
                "Phòng Phòng trọ sinh viên do ông System làm đại diện. Số điện thoại: 0934567890",
                "Phòng Phòng trọ sinh viên do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909912345",
                "Phòng Phòng trọ sinh viên do ông Việt Huỳnh làm đại diện. Số điện thoại: 0934567890"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Căn hộ mini hiện đại",
            "patterns": [
                "Thông tin liên lạc chủ phòng Căn hộ mini hiện đại",
                "Cho tôi thông tin chủ phòng Căn hộ mini hiện đại",
                "Ai là người quản lý phòng Căn hộ mini hiện đại?"
            ],
            "responses": [
                "Phòng Căn hộ mini hiện đại do ông System làm đại diện. Số điện thoại: 0912345678",
                "Phòng Căn hộ mini hiện đại do ông Việt Huỳnh làm đại diện. Số điện thoại: 0912345678"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ sinh viên tiện lợi",
            "patterns": [
                "Ai là người quản lý phòng Phòng trọ sinh viên tiện lợi?",
                "Thông tin liên lạc chủ phòng Phòng trọ sinh viên tiện lợi",
                "Cho tôi thông tin chủ phòng Phòng trọ sinh viên tiện lợi"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên tiện lợi do ông System làm đại diện. Số điện thoại: 0909123456",
                "Phòng Phòng trọ sinh viên tiện lợi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909123456"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng tiện nghi gần chợ",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng tiện nghi gần chợ",
                "Thông tin liên lạc chủ phòng Phòng tiện nghi gần chợ",
                "Ai là người quản lý phòng Phòng tiện nghi gần chợ?"
            ],
            "responses": [
                "Phòng Phòng tiện nghi gần chợ do ông System làm đại diện. Số điện thoại: 0909234567",
                "Phòng Phòng tiện nghi gần chợ do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909234567"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ hiện đại",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng trọ hiện đại",
                "Thông tin liên lạc chủ phòng Phòng trọ hiện đại",
                "Ai là người quản lý phòng Phòng trọ hiện đại?"
            ],
            "responses": [
                "Phòng Phòng trọ hiện đại do ông System làm đại diện. Số điện thoại: 0909345678",
                "Phòng Phòng trọ hiện đại do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909345678"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ sinh viên tiện nghi",
            "patterns": [
                "Thông tin liên lạc chủ phòng Phòng trọ sinh viên tiện nghi",
                "Cho tôi thông tin chủ phòng Phòng trọ sinh viên tiện nghi",
                "Ai là người quản lý phòng Phòng trọ sinh viên tiện nghi?"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên tiện nghi do ông System làm đại diện. Số điện thoại: 0909456789",
                "Phòng Phòng trọ sinh viên tiện nghi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909456789"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ tiện nghi hiện đại",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng trọ tiện nghi hiện đại",
                "Thông tin liên lạc chủ phòng Phòng trọ tiện nghi hiện đại",
                "Ai là người quản lý phòng Phòng trọ tiện nghi hiện đại?"
            ],
            "responses": [
                "Phòng Phòng trọ tiện nghi hiện đại do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909567890",
                "Phòng Phòng trọ tiện nghi hiện đại do ông System làm đại diện. Số điện thoại: 0909567890"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ rộng rãi",
            "patterns": [
                "Ai là người quản lý phòng Phòng trọ rộng rãi?",
                "Cho tôi thông tin chủ phòng Phòng trọ rộng rãi",
                "Thông tin liên lạc chủ phòng Phòng trọ rộng rãi"
            ],
            "responses": [
                "Phòng Phòng trọ rộng rãi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909678901",
                "Phòng Phòng trọ rộng rãi do ông System làm đại diện. Số điện thoại: 0909678901"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng tiện nghi cơ bản",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng tiện nghi cơ bản",
                "Thông tin liên lạc chủ phòng Phòng tiện nghi cơ bản",
                "Ai là người quản lý phòng Phòng tiện nghi cơ bản?"
            ],
            "responses": [
                "Phòng Phòng tiện nghi cơ bản do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909890123",
                "Phòng Phòng tiện nghi cơ bản do ông System làm đại diện. Số điện thoại: 0909890123"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng mới tiện nghi",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng mới tiện nghi",
                "Thông tin liên lạc chủ phòng Phòng mới tiện nghi",
                "Ai là người quản lý phòng Phòng mới tiện nghi?"
            ],
            "responses": [
                "Phòng Phòng mới tiện nghi do ông System làm đại diện. Số điện thoại: 0909901234",
                "Phòng Phòng mới tiện nghi do ông Việt Huỳnh làm đại diện. Số điện thoại: 0909901234"
            ]
        },
        {
            "tag": "Thông tin chủ phòng test",
            "patterns": [
                "Thông tin liên lạc chủ phòng test",
                "Ai là người quản lý phòng test?",
                "Cho tôi thông tin chủ phòng test"
            ],
            "responses": [
                "Phòng test do ông null làm đại diện. Số điện thoại: 20",
                "Phòng test do ông Việt Huỳnh làm đại diện. Số điện thoại: 0999999999"
            ]
        },
        {
            "tag": "Tiện ích phòng Studio mới xây",
            "patterns": [
                "Phòng Studio mới xây có tiện ích gì?",
                "Tiện ích phòng Studio mới xây",
                "Cho tôi thông tin tiện ích của phòng Studio mới xây"
            ],
            "responses": [
                "Phòng Studio mới xây có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=false}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng studio tiện nghi",
            "patterns": [
                "Phòng Phòng studio tiện nghi có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Phòng studio tiện nghi",
                "Tiện ích phòng Phòng studio tiện nghi"
            ],
            "responses": [
                "Phòng Phòng studio tiện nghi có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Căn hộ mini view đẹp",
            "patterns": [
                "Phòng Căn hộ mini view đẹp có tiện ích gì?",
                "Tiện ích phòng Căn hộ mini view đẹp",
                "Cho tôi thông tin tiện ích của phòng Căn hộ mini view đẹp"
            ],
            "responses": [
                "Phòng Căn hộ mini view đẹp có các tiện ích: {Bed=true, Sofa=true, Table=false, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ tiện nghi",
            "patterns": [
                "Phòng Phòng trọ tiện nghi có tiện ích gì?",
                "Tiện ích phòng Phòng trọ tiện nghi",
                "Cho tôi thông tin tiện ích của phòng Phòng trọ tiện nghi"
            ],
            "responses": [
                "Phòng Phòng trọ tiện nghi có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=false, Heater=false, WashingMachine=false}",
                "Phòng Phòng trọ tiện nghi có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=false}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=true}",
                "Phòng Phòng trọ tiện nghi có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Căn hộ dịch vụ sang trọng",
            "patterns": [
                "Phòng Căn hộ dịch vụ sang trọng có tiện ích gì?",
                "Tiện ích phòng Căn hộ dịch vụ sang trọng",
                "Cho tôi thông tin tiện ích của phòng Căn hộ dịch vụ sang trọng"
            ],
            "responses": [
                "Phòng Căn hộ dịch vụ sang trọng có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ sinh viên",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng trọ sinh viên",
                "Phòng Phòng trọ sinh viên có tiện ích gì?",
                "Tiện ích phòng Phòng trọ sinh viên"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=false}",
                "Phòng Phòng trọ sinh viên có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Căn hộ mini hiện đại",
            "patterns": [
                "Tiện ích phòng Căn hộ mini hiện đại",
                "Cho tôi thông tin tiện ích của phòng Căn hộ mini hiện đại",
                "Phòng Căn hộ mini hiện đại có tiện ích gì?"
            ],
            "responses": [
                "Phòng Căn hộ mini hiện đại có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ sinh viên tiện lợi",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng trọ sinh viên tiện lợi",
                "Phòng Phòng trọ sinh viên tiện lợi có tiện ích gì?",
                "Tiện ích phòng Phòng trọ sinh viên tiện lợi"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên tiện lợi có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=false}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng tiện nghi gần chợ",
            "patterns": [
                "Tiện ích phòng Phòng tiện nghi gần chợ",
                "Cho tôi thông tin tiện ích của phòng Phòng tiện nghi gần chợ",
                "Phòng Phòng tiện nghi gần chợ có tiện ích gì?"
            ],
            "responses": [
                "Phòng Phòng tiện nghi gần chợ có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=false, Heater=false, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ hiện đại",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng trọ hiện đại",
                "Tiện ích phòng Phòng trọ hiện đại",
                "Phòng Phòng trọ hiện đại có tiện ích gì?"
            ],
            "responses": [
                "Phòng Phòng trọ hiện đại có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ sinh viên tiện nghi",
            "patterns": [
                "Tiện ích phòng Phòng trọ sinh viên tiện nghi",
                "Phòng Phòng trọ sinh viên tiện nghi có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Phòng trọ sinh viên tiện nghi"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên tiện nghi có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=false, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ tiện nghi hiện đại",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng trọ tiện nghi hiện đại",
                "Phòng Phòng trọ tiện nghi hiện đại có tiện ích gì?",
                "Tiện ích phòng Phòng trọ tiện nghi hiện đại"
            ],
            "responses": [
                "Phòng Phòng trọ tiện nghi hiện đại có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=false}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ rộng rãi",
            "patterns": [
                "Phòng Phòng trọ rộng rãi có tiện ích gì?",
                "Tiện ích phòng Phòng trọ rộng rãi",
                "Cho tôi thông tin tiện ích của phòng Phòng trọ rộng rãi"
            ],
            "responses": [
                "Phòng Phòng trọ rộng rãi có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng tiện nghi cơ bản",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng tiện nghi cơ bản",
                "Phòng Phòng tiện nghi cơ bản có tiện ích gì?",
                "Tiện ích phòng Phòng tiện nghi cơ bản"
            ],
            "responses": [
                "Phòng Phòng tiện nghi cơ bản có các tiện ích: {Bed=true, Sofa=false, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=false, Heater=false, WashingMachine=false}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng mới tiện nghi",
            "patterns": [
                "Tiện ích phòng Phòng mới tiện nghi",
                "Phòng Phòng mới tiện nghi có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Phòng mới tiện nghi"
            ],
            "responses": [
                "Phòng Phòng mới tiện nghi có các tiện ích: {Bed=true, Sofa=true, Table=true, Chair=true}, nội thất: {WiFi=true, AirConditioner=true, Heater=true, WashingMachine=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng test",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng test",
                "Phòng test có tiện ích gì?",
                "Tiện ích phòng test"
            ],
            "responses": [
                "Phòng test có các tiện ích: {}, nội thất: {}",
                "Phòng test có các tiện ích: {test=true}, nội thất: {test=true}"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Studio mới xây",
            "patterns": [
                "Phòng Studio mới xây có các loại phí gì?",
                "Thông tin giá cả phòng Studio mới xây",
                "Cho tôi thông tin các loại phí của phòng Studio mới xây"
            ],
            "responses": [
                "Phòng Studio mới xây có các loại phí như sau: Phí nhà hàng tháng: 1500.00 VNĐ, Phí nước sinh hoạt: 40.00 VNĐ, Phí điện: 60.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 150.00 VNĐ; Loại phí: PetDeposit, Số tiền: 300.00 VNĐ",
                "Phòng Studio mới xây có các loại phí như sau: Phí nhà hàng tháng: 1500 VNĐ, Phí nước sinh hoạt: 40 VNĐ, Phí điện: 60 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 150 VNĐ; Loại phí: PetDeposit, Số tiền: 300 VNĐ",
                "Phòng Studio mới xây có các loại phí như sau: Phí nhà hàng tháng: 1500000 VNĐ, Phí nước sinh hoạt: 40000 VNĐ, Phí điện: 60000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 150.00 VNĐ; Loại phí: PetDeposit, Số tiền: 300.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng studio tiện nghi",
            "patterns": [
                "Thông tin giá cả phòng Phòng studio tiện nghi",
                "Cho tôi thông tin các loại phí của phòng Phòng studio tiện nghi",
                "Phòng Phòng studio tiện nghi có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng studio tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 1200000 VNĐ, Phí nước sinh hoạt: 30000 VNĐ, Phí điện: 50000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 100.00 VNĐ; Loại phí: CleaningFee, Số tiền: 50.00 VNĐ",
                "Phòng Phòng studio tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 1200.00 VNĐ, Phí nước sinh hoạt: 30.00 VNĐ, Phí điện: 50.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 100.00 VNĐ; Loại phí: CleaningFee, Số tiền: 50.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Căn hộ mini view đẹp",
            "patterns": [
                "Phòng Căn hộ mini view đẹp có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng Căn hộ mini view đẹp",
                "Thông tin giá cả phòng Căn hộ mini view đẹp"
            ],
            "responses": [
                "Phòng Căn hộ mini view đẹp có các loại phí như sau: Phí nhà hàng tháng: 1400000 VNĐ, Phí nước sinh hoạt: 35000 VNĐ, Phí điện: 55000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 120.00 VNĐ; Loại phí: MaintenanceFee, Số tiền: 80.00 VNĐ",
                "Phòng Căn hộ mini view đẹp có các loại phí như sau: Phí nhà hàng tháng: 1400.00 VNĐ, Phí nước sinh hoạt: 35.00 VNĐ, Phí điện: 55.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 120.00 VNĐ; Loại phí: MaintenanceFee, Số tiền: 80.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ tiện nghi",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng trọ tiện nghi",
                "Thông tin giá cả phòng Phòng trọ tiện nghi",
                "Phòng Phòng trọ tiện nghi có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng trọ tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 1000000 VNĐ, Phí nước sinh hoạt: 20000 VNĐ, Phí điện: 40000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 60.00 VNĐ; Loại phí: CleaningFee, Số tiền: 30.00 VNĐ",
                "Phòng Phòng trọ tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 1100000 VNĐ, Phí nước sinh hoạt: 22000 VNĐ, Phí điện: 38000 VNĐ, Các phí bổ sung: Loại phí: ServiceFee, Số tiền: 20.00 VNĐ",
                "Phòng Phòng trọ tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 600.00 VNĐ, Phí nước sinh hoạt: 20.00 VNĐ, Phí điện: 40.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ; Loại phí: CleaningFee, Số tiền: 15.00 VNĐ",
                "Phòng Phòng trọ tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 1100.00 VNĐ, Phí nước sinh hoạt: 22.00 VNĐ, Phí điện: 38.00 VNĐ, Các phí bổ sung: Loại phí: ServiceFee, Số tiền: 20.00 VNĐ",
                "Phòng Phòng trọ tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 600000 VNĐ, Phí nước sinh hoạt: 20000 VNĐ, Phí điện: 40000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ; Loại phí: CleaningFee, Số tiền: 15.00 VNĐ",
                "Phòng Phòng trọ tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 1000.00 VNĐ, Phí nước sinh hoạt: 20.00 VNĐ, Phí điện: 40.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 60.00 VNĐ; Loại phí: CleaningFee, Số tiền: 30.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Căn hộ dịch vụ sang trọng",
            "patterns": [
                "Thông tin giá cả phòng Căn hộ dịch vụ sang trọng",
                "Phòng Căn hộ dịch vụ sang trọng có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng Căn hộ dịch vụ sang trọng"
            ],
            "responses": [
                "Phòng Căn hộ dịch vụ sang trọng có các loại phí như sau: Phí nhà hàng tháng: 2000000 VNĐ, Phí nước sinh hoạt: 50000 VNĐ, Phí điện: 70000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 200.00 VNĐ; Loại phí: SecurityDeposit, Số tiền: 500.00 VNĐ",
                "Phòng Căn hộ dịch vụ sang trọng có các loại phí như sau: Phí nhà hàng tháng: 2000.00 VNĐ, Phí nước sinh hoạt: 50.00 VNĐ, Phí điện: 70.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 200.00 VNĐ; Loại phí: SecurityDeposit, Số tiền: 500.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ sinh viên",
            "patterns": [
                "Thông tin giá cả phòng Phòng trọ sinh viên",
                "Cho tôi thông tin các loại phí của phòng Phòng trọ sinh viên",
                "Phòng Phòng trọ sinh viên có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên có các loại phí như sau: Phí nhà hàng tháng: 820000 VNĐ, Phí nước sinh hoạt: 27000 VNĐ, Phí điện: 45000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 55.00 VNĐ",
                "Phòng Phòng trọ sinh viên có các loại phí như sau: Phí nhà hàng tháng: 700.00 VNĐ, Phí nước sinh hoạt: 15.00 VNĐ, Phí điện: 30.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 40.00 VNĐ; Loại phí: ServiceFee, Số tiền: 25.00 VNĐ",
                "Phòng Phòng trọ sinh viên có các loại phí như sau: Phí nhà hàng tháng: 700000 VNĐ, Phí nước sinh hoạt: 15000 VNĐ, Phí điện: 30000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 40.00 VNĐ; Loại phí: ServiceFee, Số tiền: 25.00 VNĐ",
                "Phòng Phòng trọ sinh viên có các loại phí như sau: Phí nhà hàng tháng: 820.00 VNĐ, Phí nước sinh hoạt: 27.00 VNĐ, Phí điện: 45.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 55.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Căn hộ mini hiện đại",
            "patterns": [
                "Phòng Căn hộ mini hiện đại có các loại phí gì?",
                "Thông tin giá cả phòng Căn hộ mini hiện đại",
                "Cho tôi thông tin các loại phí của phòng Căn hộ mini hiện đại"
            ],
            "responses": [
                "Phòng Căn hộ mini hiện đại có các loại phí như sau: Phí nhà hàng tháng: 1300.00 VNĐ, Phí nước sinh hoạt: 40.00 VNĐ, Phí điện: 60.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 100.00 VNĐ; Loại phí: CleaningFee, Số tiền: 50.00 VNĐ",
                "Phòng Căn hộ mini hiện đại có các loại phí như sau: Phí nhà hàng tháng: 1300000 VNĐ, Phí nước sinh hoạt: 40000 VNĐ, Phí điện: 60000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 100.00 VNĐ; Loại phí: CleaningFee, Số tiền: 50.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ sinh viên tiện lợi",
            "patterns": [
                "Phòng Phòng trọ sinh viên tiện lợi có các loại phí gì?",
                "Thông tin giá cả phòng Phòng trọ sinh viên tiện lợi",
                "Cho tôi thông tin các loại phí của phòng Phòng trọ sinh viên tiện lợi"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên tiện lợi có các loại phí như sau: Phí nhà hàng tháng: 750.00 VNĐ, Phí nước sinh hoạt: 20.00 VNĐ, Phí điện: 35.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 45.00 VNĐ; Loại phí: ServiceFee, Số tiền: 20.00 VNĐ",
                "Phòng Phòng trọ sinh viên tiện lợi có các loại phí như sau: Phí nhà hàng tháng: 750000 VNĐ, Phí nước sinh hoạt: 20000 VNĐ, Phí điện: 35000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 45.00 VNĐ; Loại phí: ServiceFee, Số tiền: 20.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng tiện nghi gần chợ",
            "patterns": [
                "Phòng Phòng tiện nghi gần chợ có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng Phòng tiện nghi gần chợ",
                "Thông tin giá cả phòng Phòng tiện nghi gần chợ"
            ],
            "responses": [
                "Phòng Phòng tiện nghi gần chợ có các loại phí như sau: Phí nhà hàng tháng: 700.00 VNĐ, Phí nước sinh hoạt: 18.00 VNĐ, Phí điện: 30.00 VNĐ, Các phí bổ sung: Loại phí: ServiceFee, Số tiền: 15.00 VNĐ",
                "Phòng Phòng tiện nghi gần chợ có các loại phí như sau: Phí nhà hàng tháng: 700000 VNĐ, Phí nước sinh hoạt: 18000 VNĐ, Phí điện: 30000 VNĐ, Các phí bổ sung: Loại phí: ServiceFee, Số tiền: 15.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ hiện đại",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng trọ hiện đại",
                "Thông tin giá cả phòng Phòng trọ hiện đại",
                "Phòng Phòng trọ hiện đại có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng trọ hiện đại có các loại phí như sau: Phí nhà hàng tháng: 800.00 VNĐ, Phí nước sinh hoạt: 25.00 VNĐ, Phí điện: 40.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ; Loại phí: ServiceFee, Số tiền: 25.00 VNĐ",
                "Phòng Phòng trọ hiện đại có các loại phí như sau: Phí nhà hàng tháng: 800000 VNĐ, Phí nước sinh hoạt: 25000 VNĐ, Phí điện: 40000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ; Loại phí: ServiceFee, Số tiền: 25.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ sinh viên tiện nghi",
            "patterns": [
                "Thông tin giá cả phòng Phòng trọ sinh viên tiện nghi",
                "Cho tôi thông tin các loại phí của phòng Phòng trọ sinh viên tiện nghi",
                "Phòng Phòng trọ sinh viên tiện nghi có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng trọ sinh viên tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 780000 VNĐ, Phí nước sinh hoạt: 22000 VNĐ, Phí điện: 38000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ",
                "Phòng Phòng trọ sinh viên tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 780.00 VNĐ, Phí nước sinh hoạt: 22.00 VNĐ, Phí điện: 38.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ tiện nghi hiện đại",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng trọ tiện nghi hiện đại",
                "Thông tin giá cả phòng Phòng trọ tiện nghi hiện đại",
                "Phòng Phòng trọ tiện nghi hiện đại có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng trọ tiện nghi hiện đại có các loại phí như sau: Phí nhà hàng tháng: 760.00 VNĐ, Phí nước sinh hoạt: 21.00 VNĐ, Phí điện: 32.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 40.00 VNĐ; Loại phí: ServiceFee, Số tiền: 20.00 VNĐ",
                "Phòng Phòng trọ tiện nghi hiện đại có các loại phí như sau: Phí nhà hàng tháng: 760000 VNĐ, Phí nước sinh hoạt: 21000 VNĐ, Phí điện: 32000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 40.00 VNĐ; Loại phí: ServiceFee, Số tiền: 20.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ rộng rãi",
            "patterns": [
                "Thông tin giá cả phòng Phòng trọ rộng rãi",
                "Phòng Phòng trọ rộng rãi có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng Phòng trọ rộng rãi"
            ],
            "responses": [
                "Phòng Phòng trọ rộng rãi có các loại phí như sau: Phí nhà hàng tháng: 790.00 VNĐ, Phí nước sinh hoạt: 25.00 VNĐ, Phí điện: 45.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ",
                "Phòng Phòng trọ rộng rãi có các loại phí như sau: Phí nhà hàng tháng: 790000 VNĐ, Phí nước sinh hoạt: 25000 VNĐ, Phí điện: 45000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng tiện nghi cơ bản",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng tiện nghi cơ bản",
                "Thông tin giá cả phòng Phòng tiện nghi cơ bản",
                "Phòng Phòng tiện nghi cơ bản có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng tiện nghi cơ bản có các loại phí như sau: Phí nhà hàng tháng: 690000 VNĐ, Phí nước sinh hoạt: 18000 VNĐ, Phí điện: 30000 VNĐ, Các phí bổ sung: Loại phí: ServiceFee, Số tiền: 15.00 VNĐ",
                "Phòng Phòng tiện nghi cơ bản có các loại phí như sau: Phí nhà hàng tháng: 690.00 VNĐ, Phí nước sinh hoạt: 18.00 VNĐ, Phí điện: 30.00 VNĐ, Các phí bổ sung: Loại phí: ServiceFee, Số tiền: 15.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng mới tiện nghi",
            "patterns": [
                "Thông tin giá cả phòng Phòng mới tiện nghi",
                "Phòng Phòng mới tiện nghi có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng Phòng mới tiện nghi"
            ],
            "responses": [
                "Phòng Phòng mới tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 800000 VNĐ, Phí nước sinh hoạt: 23000 VNĐ, Phí điện: 40000 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ",
                "Phòng Phòng mới tiện nghi có các loại phí như sau: Phí nhà hàng tháng: 800.00 VNĐ, Phí nước sinh hoạt: 23.00 VNĐ, Phí điện: 40.00 VNĐ, Các phí bổ sung: Loại phí: Parking, Số tiền: 50.00 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng test",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng test",
                "Thông tin giá cả phòng test",
                "Phòng test có các loại phí gì?"
            ],
            "responses": [
                "Phòng test có các loại phí như sau: Phí nhà hàng tháng: 20 VNĐ, Phí nước sinh hoạt: 20 VNĐ, Phí điện: 20 VNĐ, Các phí bổ sung: Loại phí: test, Số tiền: 20 VNĐ",
                "Phòng test có các loại phí như sau: Phí nhà hàng tháng: 4 VNĐ, Phí nước sinh hoạt: 4 VNĐ, Phí điện: 4 VNĐ, Các phí bổ sung: Loại phí: test, Số tiền: 3 VNĐ"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "hôm nay là ngày bao nhiêu"
            ],
            "responses": [
                "chưa xác định"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "1 + 1 = ?"
            ],
            "responses": [
                "Gemini"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "1 + 2 = ?"
            ],
            "responses": [
                "Gemini"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "4 + 5 = ?"
            ],
            "responses": [
                "4 + 5 = 9\n"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "10+10 =?"
            ],
            "responses": [
                "10 + 10 = 20\n"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "10+11 =?"
            ],
            "responses": [
                "10 + 11 = 21\n"
            ]
        },
        {
            "tag": "Địa chỉ phòng Căn hộ Sunrise City",
            "patterns": [
                "Căn hộ Sunrise City địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng Căn hộ Sunrise City",
                "Địa chỉ của phòng Căn hộ Sunrise City là gì?"
            ],
            "responses": [
                "Căn hộ Sunrise City - Địa chỉ: 123 Đường Nguyễn Huệ, Phường Bến Nghé, Quận 1, TP. Hồ Chí Minh"
            ]
        },
        {
            "tag": "Trạng thái phòng Căn hộ Sunrise City",
            "patterns": [
                "Phòng Căn hộ Sunrise City có còn trống không?",
                "Căn hộ Sunrise City còn phòng không?",
                "Trạng thái của phòng Căn hộ Sunrise City"
            ],
            "responses": [
                "Căn hộ Sunrise City - Trạng thái: PENDING",
                "Căn hộ Sunrise City - Trạng thái: Đang chờ duyệt"
            ]
        },
        {
            "tag": "Diện tích phòng Căn hộ Sunrise City",
            "patterns": [
                "Căn hộ Sunrise City diện tích như thế nào?",
                "Kích thước phòng Căn hộ Sunrise City",
                "Diện tích phòng Căn hộ Sunrise City là bao nhiêu?"
            ],
            "responses": [
                "Căn hộ Sunrise City - có chiều dài: 8.0m, chiều rộng: 6.0m, diện tích tổng: 48.0m²"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Căn hộ Sunrise City",
            "patterns": [
                "Cho tôi thông tin chủ phòng Căn hộ Sunrise City",
                "Ai là người quản lý phòng Căn hộ Sunrise City?",
                "Thông tin liên lạc chủ phòng Căn hộ Sunrise City"
            ],
            "responses": [
                "Phòng Căn hộ Sunrise City do ông Việt Huỳnh làm đại diện. Số điện thoại: Nguyễn Văn A - 0123456789"
            ]
        },
        {
            "tag": "Tiện ích phòng Căn hộ Sunrise City",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Căn hộ Sunrise City",
                "Tiện ích phòng Căn hộ Sunrise City",
                "Phòng Căn hộ Sunrise City có tiện ích gì?"
            ],
            "responses": [
                "Phòng Căn hộ Sunrise City có các tiện ích: {sofa=true, bed=true, kitchen=true}, nội thất: {wifi=true, airConditioning=true, parking=true}"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Căn hộ Sunrise City",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Căn hộ Sunrise City",
                "Thông tin giá cả phòng Căn hộ Sunrise City",
                "Phòng Căn hộ Sunrise City có các loại phí gì?"
            ],
            "responses": [
                "Phòng Căn hộ Sunrise City có các loại phí như sau: Phí nhà hàng tháng: 1.5E+10 VNĐ, Phí nước sinh hoạt: 20000000 VNĐ, Phí điện: 3000000 VNĐ, Các phí bổ sung: Loại phí: Phí quản lý, Số tiền: 100000 VNĐ; Loại phí: Phí vệ sinh, Số tiền: 50000 VNĐ",
                "Phòng Căn hộ Sunrise City có các loại phí như sau: Phí nhà hàng tháng: 15000000 VNĐ, Phí nước sinh hoạt: 20000 VNĐ, Phí điện: 3000 VNĐ, Các phí bổ sung: Loại phí: Phí quản lý, Số tiền: 100000 VNĐ; Loại phí: Phí vệ sinh, Số tiền: 50000 VNĐ"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "xin chào bạn!"
            ],
            "responses": [
                "Chào bạn! Có gì mình có thể giúp bạn không?\n"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "xin chào!"
            ],
            "responses": [
                "Xin chào!  (Hello!)\n"
            ]
        },
        {
            "tag": "Địa chỉ phòng tesst",
            "patterns": [
                "tesst địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng tesst",
                "Địa chỉ của phòng tesst là gì?"
            ],
            "responses": [
                "tesst - Địa chỉ: tesst"
            ]
        },
        {
            "tag": "Trạng thái phòng tesst",
            "patterns": [
                "tesst còn phòng không?",
                "Phòng tesst có còn trống không?",
                "Trạng thái của phòng tesst"
            ],
            "responses": [
                "tesst - Trạng thái: pending"
            ]
        },
        {
            "tag": "Diện tích phòng tesst",
            "patterns": [
                "Kích thước phòng tesst",
                "tesst diện tích như thế nào?",
                "Diện tích phòng tesst là bao nhiêu?"
            ],
            "responses": [
                "tesst - có chiều dài: 2.0m, chiều rộng: 3.0m, diện tích tổng: 2.0m²"
            ]
        },
        {
            "tag": "Thông tin chủ phòng tesst",
            "patterns": [
                "Ai là người quản lý phòng tesst?",
                "Cho tôi thông tin chủ phòng tesst",
                "Thông tin liên lạc chủ phòng tesst"
            ],
            "responses": [
                "Phòng tesst do ông Admin Huynh làm đại diện. Số điện thoại: 0329615399"
            ]
        },
        {
            "tag": "Tiện ích phòng tesst",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng tesst",
                "Tiện ích phòng tesst",
                "Phòng tesst có tiện ích gì?"
            ],
            "responses": [
                "Phòng tesst có các tiện ích: {a=true}, nội thất: {b=true}"
            ]
        },
        {
            "tag": "Chi tiết phí phòng tesst",
            "patterns": [
                "Phòng tesst có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng tesst",
                "Thông tin giá cả phòng tesst"
            ],
            "responses": [
                "Phòng tesst có các loại phí như sau: Phí nhà hàng tháng: 231 VNĐ, Phí nước sinh hoạt: 123 VNĐ, Phí điện: 123 VNĐ, Các phí bổ sung: Loại phí: a, Số tiền: 12 VNĐ"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "hôm nay bạn như thế nào"
            ],
            "responses": [
                "Tôi ổn, cảm ơn bạn đã hỏi! Là một mô hình ngôn ngữ lớn, tôi không trải nghiệm cảm xúc theo cùng một cách con người làm, nhưng tôi đang hoạt động tốt và sẵn sàng trả lời câu hỏi của bạn.  Bạn hôm nay thế nào?\n"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "liệt kê danh sách phòng trọ"
            ],
            "responses": [
                "Tôi cần thêm thông tin để liệt kê danh sách phòng trọ.  Vui lòng cho tôi biết:\n\n* **Vị trí:**  Bạn muốn tìm phòng trọ ở đâu? (Ví dụ: Quận 1, Hồ Chí Minh; Hà Nội;  khu vực gần trường Đại học X...)\n* **Giá:** Bạn có ngân sách bao nhiêu cho mỗi tháng?\n* **Loại phòng:** Bạn muốn phòng riêng, phòng ở ghép, hay căn hộ?\n* **Tiện nghi:** Bạn cần những tiện nghi gì? (Ví dụ: máy lạnh, máy giặt, wifi, bếp...)\n* **Diện tích:** Bạn cần phòng có diện tích bao nhiêu mét vuông?\n\n\nCung cấp càng nhiều thông tin càng tốt để tôi có thể giúp bạn tìm kiếm hiệu quả hơn.\n"
            ]
        },
        {
            "tag": "chưa xác định",
            "patterns": [
                "viết cho tôi bản hợp đồng thuê trọ với phòng trên"
            ],
            "responses": [
                "HỢP ĐỒNG THUÊ NHÀ TRỌ\n\nNgày ..... tháng ..... năm .....\n\n**Căn cứ:** Luật Dân sự năm 2015;\n\n**Chúng tôi gồm:**\n\n* **BÊN CHO THUÊ (BCT):** Ông/Bà ..............................................................................\nĐịa chỉ thường trú: .............................................................................................\nSố chứng minh thư/Căn cước công dân: ...................................................................\nĐiện thoại: .......................................................................................................\n\n* **BÊN THUÊ (BT):** Ông/Bà ..............................................................................\nĐịa chỉ thường trú: .............................................................................................\nSố chứng minh thư/Căn cước công dân: ...................................................................\nĐiện thoại: .......................................................................................................\n\nHai bên cùng thỏa thuận ký kết hợp đồng thuê nhà trọ với các điều khoản như sau:\n\n**Điều 1: Đối tượng thuê**\n\nBên cho thuê cho bên thuê thuê nhà trọ tại địa chỉ: ............................................................................................. gồm:  (mô tả chi tiết phòng, ví dụ: Phòng số ..., tầng ..., diện tích ..., bao gồm các thiết bị: giường, tủ, máy lạnh, quạt,...)\n\n**Điều 2: Thời hạn thuê**\n\nThời hạn thuê nhà trọ là ....... (ghi bằng chữ) tháng, kể từ ngày ....... tháng ....... năm ....... đến hết ngày ....... tháng ....... năm .......\n\n**Điều 3: Tiền thuê nhà**\n\n* Tiền thuê nhà là: ................. (ghi bằng chữ) đồng/tháng.\n* Hình thức thanh toán: ..................................................................................... (Ví dụ: Thanh toán hàng tháng, trước hoặc sau mỗi tháng)\n* Thời điểm thanh toán: Vào ngày ....... hàng tháng.\n* Bên thuê sẽ thanh toán tiền nhà cho bên cho thuê tại: ....................................................\n\n**Điều 4: Tiền đặt cọc**\n\nBên thuê đặt cọc cho bên cho thuê số tiền: ................. (ghi bằng chữ) đồng. Số tiền này sẽ được bên cho thuê hoàn trả lại cho bên thuê sau khi hết hạn hợp đồng và bên thuê đã bàn giao lại nhà trọ trong tình trạng nguyên vẹn (trừ trường hợp hư hỏng do lỗi của bên thuê).\n\n**Điều 5: Trách nhiệm của bên cho thuê**\n\n* Bên cho thuê có trách nhiệm đảm bảo nhà trọ cho bên thuê được sử dụng trong suốt thời gian thuê.\n* Bên cho thuê có trách nhiệm sửa chữa các hư hỏng do lỗi của bên cho thuê gây ra.\n* Bên cho thuê chịu trách nhiệm cung cấp các dịch vụ tiện ích đã được thỏa thuận (nếu có, liệt kê cụ thể).\n\n**Điều 6: Trách nhiệm của bên thuê**\n\n* Bên thuê có trách nhiệm thanh toán tiền thuê nhà đúng thời hạn.\n* Bên thuê có trách nhiệm giữ gìn nhà trọ sạch sẽ, không gây mất vệ sinh môi trường.\n* Bên thuê có trách nhiệm sử dụng nhà trọ đúng mục đích, không được sử dụng vào mục đích trái pháp luật.\n* Bên thuê có trách nhiệm báo cho bên cho thuê biết khi có sự cố xảy ra.\n* Bên thuê có trách nhiệm tự chịu trách nhiệm về tài sản cá nhân trong phòng.\n* Bên thuê phải chịu trách nhiệm về các hư hỏng do mình gây ra (trừ trường hợp hư hỏng thông thường do sử dụng).\n\n**Điều 7: Giải quyết tranh chấp**\n\nCác tranh chấp phát sinh từ hợp đồng này sẽ được giải quyết bằng thương lượng. Nếu thương lượng không thành, hai bên sẽ giải quyết theo quy định của pháp luật.\n\n**Điều 8: Điều khoản khác**\n\n(Ghi thêm các điều khoản khác nếu cần thiết, ví dụ: thời gian báo trước khi chấm dứt hợp đồng, quy định về điện, nước,...)\n\n**Điều 9: Chữ ký của hai bên**\n\n\nBÊN CHO THUÊ                                                                   BÊN THUÊ\n\n(Ký và ghi rõ họ tên)                                                              (Ký và ghi rõ họ tên)\n\n\n.....................................................................                              .....................................................................\n\n\n**Lưu ý:**  Đây chỉ là bản hợp đồng mẫu, các bên cần bổ sung hoặc điều chỉnh các điều khoản cho phù hợp với thực tế.  Nên tham khảo ý kiến luật sư để đảm bảo tính pháp lý của hợp đồng.\n"
            ]
        },
        {
            "tag": "Địa chỉ phòng Quang Cáo",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Quang Cáo",
                "Quang Cáo địa chỉ ở đâu?",
                "Địa chỉ của phòng Quang Cáo là gì?"
            ],
            "responses": [
                "Quang Cáo - Địa chỉ: Quang Cáo"
            ]
        },
        {
            "tag": "Địa chỉ phòng 9",
            "patterns": [
                "9 địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng 9",
                "Địa chỉ của phòng 9 là gì?"
            ],
            "responses": [
                "9 - Địa chỉ: quoc"
            ]
        },
        {
            "tag": "Trạng thái phòng Quang Cáo",
            "patterns": [
                "Phòng Quang Cáo có còn trống không?",
                "Trạng thái của phòng Quang Cáo",
                "Quang Cáo còn phòng không?"
            ],
            "responses": [
                "Quang Cáo - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng 9",
            "patterns": [
                "Trạng thái của phòng 9",
                "Phòng 9 có còn trống không?",
                "9 còn phòng không?"
            ],
            "responses": [
                "9 - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Diện tích phòng Quang Cáo",
            "patterns": [
                "Diện tích phòng Quang Cáo là bao nhiêu?",
                "Kích thước phòng Quang Cáo",
                "Quang Cáo diện tích như thế nào?"
            ],
            "responses": [
                "Quang Cáo - có chiều dài: 12.0m, chiều rộng: 12.0m, diện tích tổng: 144.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng 9",
            "patterns": [
                "Diện tích phòng 9 là bao nhiêu?",
                "Kích thước phòng 9",
                "9 diện tích như thế nào?"
            ],
            "responses": [
                "9 - có chiều dài: 1.0m, chiều rộng: 2.0m, diện tích tổng: 2.0m²"
            ]
        },
        {
            "tag": "Tiện ích phòng Quang Cáo",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Quang Cáo",
                "Tiện ích phòng Quang Cáo",
                "Phòng Quang Cáo có tiện ích gì?"
            ],
            "responses": [
                "Phòng Quang Cáo có các tiện ích: {}, nội thất: {}"
            ]
        },
        {
            "tag": "Tiện ích phòng 9",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng 9",
                "Tiện ích phòng 9",
                "Phòng 9 có tiện ích gì?"
            ],
            "responses": [
                "Phòng 9 có các tiện ích: {}, nội thất: {}"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Quang Cáo",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Quang Cáo",
                "Thông tin giá cả phòng Quang Cáo",
                "Phòng Quang Cáo có các loại phí gì?"
            ],
            "responses": [
                "Phòng Quang Cáo có các loại phí như sau: Phí nhà hàng tháng: 12312 VNĐ, Phí nước sinh hoạt: 123123 VNĐ, Phí điện: 12313 VNĐ, Các phí bổ sung: "
            ]
        },
        {
            "tag": "Chi tiết phí phòng 9",
            "patterns": [
                "Phòng 9 có các loại phí gì?",
                "Thông tin giá cả phòng 9",
                "Cho tôi thông tin các loại phí của phòng 9"
            ],
            "responses": [
                "Phòng 9 có các loại phí như sau: Phí nhà hàng tháng: 10000 VNĐ, Phí nước sinh hoạt: null VNĐ, Phí điện: null VNĐ, Các phí bổ sung: "
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ Bến Nghé",
            "patterns": [
                "Địa chỉ của phòng Phòng trọ Bến Nghé là gì?",
                "Phòng trọ Bến Nghé địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng Phòng trọ Bến Nghé"
            ],
            "responses": [
                "Phòng trọ Bến Nghé - Địa chỉ: 123 Nguyễn Huệ"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ Thảo Điền",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng trọ Thảo Điền",
                "Địa chỉ của phòng Phòng trọ Thảo Điền là gì?",
                "Phòng trọ Thảo Điền địa chỉ ở đâu?"
            ],
            "responses": [
                "Phòng trọ Thảo Điền - Địa chỉ: 45 Xa lộ Hà Nội"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ Lê Văn Sỹ",
            "patterns": [
                "Địa chỉ của phòng Phòng trọ Lê Văn Sỹ là gì?",
                "Phòng trọ Lê Văn Sỹ địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng Phòng trọ Lê Văn Sỹ"
            ],
            "responses": [
                "Phòng trọ Lê Văn Sỹ - Địa chỉ: 78 Lê Văn Sỹ"
            ]
        },
        {
            "tag": "Địa chỉ phòng Căn hộ Nguyễn Huệ",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Căn hộ Nguyễn Huệ",
                "Địa chỉ của phòng Căn hộ Nguyễn Huệ là gì?",
                "Căn hộ Nguyễn Huệ địa chỉ ở đâu?"
            ],
            "responses": [
                "Căn hộ Nguyễn Huệ - Địa chỉ: 15 Nguyễn Huệ"
            ]
        },
        {
            "tag": "Địa chỉ phòng Phòng trọ Trần Hưng Đạo",
            "patterns": [
                "Tôi muốn biết địa chỉ phòng Phòng trọ Trần Hưng Đạo",
                "Phòng trọ Trần Hưng Đạo địa chỉ ở đâu?",
                "Địa chỉ của phòng Phòng trọ Trần Hưng Đạo là gì?"
            ],
            "responses": [
                "Phòng trọ Trần Hưng Đạo - Địa chỉ: 223 Trần Hưng Đạo"
            ]
        },
        {
            "tag": "Địa chỉ phòng Căn hộ Nguyễn Văn Linh",
            "patterns": [
                "Địa chỉ của phòng Căn hộ Nguyễn Văn Linh là gì?",
                "Căn hộ Nguyễn Văn Linh địa chỉ ở đâu?",
                "Tôi muốn biết địa chỉ phòng Căn hộ Nguyễn Văn Linh"
            ],
            "responses": [
                "Căn hộ Nguyễn Văn Linh - Địa chỉ: 45 Nguyễn Văn Linh"
            ]
        },
        {
            "tag": "Địa chỉ phòng Nhà Sư Vạn Hạnh",
            "patterns": [
                "Địa chỉ của phòng Nhà Sư Vạn Hạnh là gì?",
                "Tôi muốn biết địa chỉ phòng Nhà Sư Vạn Hạnh",
                "Nhà Sư Vạn Hạnh địa chỉ ở đâu?"
            ],
            "responses": [
                "Nhà Sư Vạn Hạnh - Địa chỉ: 156 Sư Vạn Hạnh"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ Bến Nghé",
            "patterns": [
                "Trạng thái của phòng Phòng trọ Bến Nghé",
                "Phòng Phòng trọ Bến Nghé có còn trống không?",
                "Phòng trọ Bến Nghé còn phòng không?"
            ],
            "responses": [
                "Phòng trọ Bến Nghé - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ Thảo Điền",
            "patterns": [
                "Trạng thái của phòng Phòng trọ Thảo Điền",
                "Phòng trọ Thảo Điền còn phòng không?",
                "Phòng Phòng trọ Thảo Điền có còn trống không?"
            ],
            "responses": [
                "Phòng trọ Thảo Điền - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ Lê Văn Sỹ",
            "patterns": [
                "Phòng trọ Lê Văn Sỹ còn phòng không?",
                "Phòng Phòng trọ Lê Văn Sỹ có còn trống không?",
                "Trạng thái của phòng Phòng trọ Lê Văn Sỹ"
            ],
            "responses": [
                "Phòng trọ Lê Văn Sỹ - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Căn hộ Nguyễn Huệ",
            "patterns": [
                "Trạng thái của phòng Căn hộ Nguyễn Huệ",
                "Phòng Căn hộ Nguyễn Huệ có còn trống không?",
                "Căn hộ Nguyễn Huệ còn phòng không?"
            ],
            "responses": [
                "Căn hộ Nguyễn Huệ - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Phòng trọ Trần Hưng Đạo",
            "patterns": [
                "Trạng thái của phòng Phòng trọ Trần Hưng Đạo",
                "Phòng trọ Trần Hưng Đạo còn phòng không?",
                "Phòng Phòng trọ Trần Hưng Đạo có còn trống không?"
            ],
            "responses": [
                "Phòng trọ Trần Hưng Đạo - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Căn hộ Nguyễn Văn Linh",
            "patterns": [
                "Trạng thái của phòng Căn hộ Nguyễn Văn Linh",
                "Căn hộ Nguyễn Văn Linh còn phòng không?",
                "Phòng Căn hộ Nguyễn Văn Linh có còn trống không?"
            ],
            "responses": [
                "Căn hộ Nguyễn Văn Linh - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Trạng thái phòng Nhà Sư Vạn Hạnh",
            "patterns": [
                "Phòng Nhà Sư Vạn Hạnh có còn trống không?",
                "Nhà Sư Vạn Hạnh còn phòng không?",
                "Trạng thái của phòng Nhà Sư Vạn Hạnh"
            ],
            "responses": [
                "Nhà Sư Vạn Hạnh - Trạng thái: ACTIVE"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ Bến Nghé",
            "patterns": [
                "Kích thước phòng Phòng trọ Bến Nghé",
                "Phòng trọ Bến Nghé diện tích như thế nào?",
                "Diện tích phòng Phòng trọ Bến Nghé là bao nhiêu?"
            ],
            "responses": [
                "Phòng trọ Bến Nghé - có chiều dài: 15.0m, chiều rộng: 4.5m, diện tích tổng: 25.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ Thảo Điền",
            "patterns": [
                "Kích thước phòng Phòng trọ Thảo Điền",
                "Phòng trọ Thảo Điền diện tích như thế nào?",
                "Diện tích phòng Phòng trọ Thảo Điền là bao nhiêu?"
            ],
            "responses": [
                "Phòng trọ Thảo Điền - có chiều dài: 14.0m, chiều rộng: 5.0m, diện tích tổng: 30.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ Lê Văn Sỹ",
            "patterns": [
                "Phòng trọ Lê Văn Sỹ diện tích như thế nào?",
                "Diện tích phòng Phòng trọ Lê Văn Sỹ là bao nhiêu?",
                "Kích thước phòng Phòng trọ Lê Văn Sỹ"
            ],
            "responses": [
                "Phòng trọ Lê Văn Sỹ - có chiều dài: 12.0m, chiều rộng: 4.0m, diện tích tổng: 20.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Căn hộ Nguyễn Huệ",
            "patterns": [
                "Diện tích phòng Căn hộ Nguyễn Huệ là bao nhiêu?",
                "Căn hộ Nguyễn Huệ diện tích như thế nào?",
                "Kích thước phòng Căn hộ Nguyễn Huệ"
            ],
            "responses": [
                "Căn hộ Nguyễn Huệ - có chiều dài: 15.0m, chiều rộng: 6.0m, diện tích tổng: 45.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Phòng trọ Trần Hưng Đạo",
            "patterns": [
                "Diện tích phòng Phòng trọ Trần Hưng Đạo là bao nhiêu?",
                "Kích thước phòng Phòng trọ Trần Hưng Đạo",
                "Phòng trọ Trần Hưng Đạo diện tích như thế nào?"
            ],
            "responses": [
                "Phòng trọ Trần Hưng Đạo - có chiều dài: 10.0m, chiều rộng: 3.5m, diện tích tổng: 15.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Căn hộ Nguyễn Văn Linh",
            "patterns": [
                "Kích thước phòng Căn hộ Nguyễn Văn Linh",
                "Diện tích phòng Căn hộ Nguyễn Văn Linh là bao nhiêu?",
                "Căn hộ Nguyễn Văn Linh diện tích như thế nào?"
            ],
            "responses": [
                "Căn hộ Nguyễn Văn Linh - có chiều dài: 14.0m, chiều rộng: 5.0m, diện tích tổng: 35.0m²"
            ]
        },
        {
            "tag": "Diện tích phòng Nhà Sư Vạn Hạnh",
            "patterns": [
                "Diện tích phòng Nhà Sư Vạn Hạnh là bao nhiêu?",
                "Kích thước phòng Nhà Sư Vạn Hạnh",
                "Nhà Sư Vạn Hạnh diện tích như thế nào?"
            ],
            "responses": [
                "Nhà Sư Vạn Hạnh - có chiều dài: 16.0m, chiều rộng: 4.5m, diện tích tổng: 72.0m²"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ Bến Nghé",
            "patterns": [
                "Thông tin liên lạc chủ phòng Phòng trọ Bến Nghé",
                "Ai là người quản lý phòng Phòng trọ Bến Nghé?",
                "Cho tôi thông tin chủ phòng Phòng trọ Bến Nghé"
            ],
            "responses": [
                "Phòng Phòng trọ Bến Nghé do ông Việt Huỳnh làm đại diện. Số điện thoại: 0901234567",
                "Phòng Phòng trọ Bến Nghé do ông Tống Thành làm đại diện. Số điện thoại: 0901234567"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ Thảo Điền",
            "patterns": [
                "Cho tôi thông tin chủ phòng Phòng trọ Thảo Điền",
                "Ai là người quản lý phòng Phòng trọ Thảo Điền?",
                "Thông tin liên lạc chủ phòng Phòng trọ Thảo Điền"
            ],
            "responses": [
                "Phòng Phòng trọ Thảo Điền do ông Trình Minh Thái Tố làm đại diện. Số điện thoại: 0902345678"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ Lê Văn Sỹ",
            "patterns": [
                "Thông tin liên lạc chủ phòng Phòng trọ Lê Văn Sỹ",
                "Ai là người quản lý phòng Phòng trọ Lê Văn Sỹ?",
                "Cho tôi thông tin chủ phòng Phòng trọ Lê Văn Sỹ"
            ],
            "responses": [
                "Phòng Phòng trọ Lê Văn Sỹ do ông Việt Huỳnh làm đại diện. Số điện thoại: 0903456789"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Căn hộ Nguyễn Huệ",
            "patterns": [
                "Thông tin liên lạc chủ phòng Căn hộ Nguyễn Huệ",
                "Cho tôi thông tin chủ phòng Căn hộ Nguyễn Huệ",
                "Ai là người quản lý phòng Căn hộ Nguyễn Huệ?"
            ],
            "responses": [
                "Phòng Căn hộ Nguyễn Huệ do ông Nam  Dương làm đại diện. Số điện thoại: 0904567890"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Phòng trọ Trần Hưng Đạo",
            "patterns": [
                "Ai là người quản lý phòng Phòng trọ Trần Hưng Đạo?",
                "Cho tôi thông tin chủ phòng Phòng trọ Trần Hưng Đạo",
                "Thông tin liên lạc chủ phòng Phòng trọ Trần Hưng Đạo"
            ],
            "responses": [
                "Phòng Phòng trọ Trần Hưng Đạo do ông Việt Huỳnh làm đại diện. Số điện thoại: 0905678901"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Căn hộ Nguyễn Văn Linh",
            "patterns": [
                "Ai là người quản lý phòng Căn hộ Nguyễn Văn Linh?",
                "Cho tôi thông tin chủ phòng Căn hộ Nguyễn Văn Linh",
                "Thông tin liên lạc chủ phòng Căn hộ Nguyễn Văn Linh"
            ],
            "responses": [
                "Phòng Căn hộ Nguyễn Văn Linh do ông Trình Minh Thái Tố làm đại diện. Số điện thoại: 0906789012"
            ]
        },
        {
            "tag": "Thông tin chủ phòng Nhà Sư Vạn Hạnh",
            "patterns": [
                "Thông tin liên lạc chủ phòng Nhà Sư Vạn Hạnh",
                "Cho tôi thông tin chủ phòng Nhà Sư Vạn Hạnh",
                "Ai là người quản lý phòng Nhà Sư Vạn Hạnh?"
            ],
            "responses": [
                "Phòng Nhà Sư Vạn Hạnh do ông Nam  Dương làm đại diện. Số điện thoại: 0907890123"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ Bến Nghé",
            "patterns": [
                "Phòng Phòng trọ Bến Nghé có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Phòng trọ Bến Nghé",
                "Tiện ích phòng Phòng trọ Bến Nghé"
            ],
            "responses": [
                "Phòng Phòng trọ Bến Nghé có các tiện ích: {bed=true, wardrobe=true, airConditioner=true, desk=true}, nội thất: {wifi=true, parking=true, elevator=false, security=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ Thảo Điền",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng trọ Thảo Điền",
                "Phòng Phòng trọ Thảo Điền có tiện ích gì?",
                "Tiện ích phòng Phòng trọ Thảo Điền"
            ],
            "responses": [
                "Phòng Phòng trọ Thảo Điền có các tiện ích: {bed=true, wardrobe=true, airConditioner=true, desk=true}, nội thất: {wifi=true, parking=true, elevator=true, security=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ Lê Văn Sỹ",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Phòng trọ Lê Văn Sỹ",
                "Phòng Phòng trọ Lê Văn Sỹ có tiện ích gì?",
                "Tiện ích phòng Phòng trọ Lê Văn Sỹ"
            ],
            "responses": [
                "Phòng Phòng trọ Lê Văn Sỹ có các tiện ích: {bed=true, wardrobe=true, airConditioner=true, desk=true}, nội thất: {wifi=true, parking=false, elevator=false, security=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Căn hộ Nguyễn Huệ",
            "patterns": [
                "Phòng Căn hộ Nguyễn Huệ có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Căn hộ Nguyễn Huệ",
                "Tiện ích phòng Căn hộ Nguyễn Huệ"
            ],
            "responses": [
                "Phòng Căn hộ Nguyễn Huệ có các tiện ích: {bed=true, wardrobe=true, airConditioner=true, desk=true}, nội thất: {wifi=true, parking=true, elevator=true, security=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Phòng trọ Trần Hưng Đạo",
            "patterns": [
                "Tiện ích phòng Phòng trọ Trần Hưng Đạo",
                "Phòng Phòng trọ Trần Hưng Đạo có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Phòng trọ Trần Hưng Đạo"
            ],
            "responses": [
                "Phòng Phòng trọ Trần Hưng Đạo có các tiện ích: {bed=true, wardrobe=true, airConditioner=false, desk=true}, nội thất: {wifi=true, parking=true, elevator=false, security=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Căn hộ Nguyễn Văn Linh",
            "patterns": [
                "Tiện ích phòng Căn hộ Nguyễn Văn Linh",
                "Phòng Căn hộ Nguyễn Văn Linh có tiện ích gì?",
                "Cho tôi thông tin tiện ích của phòng Căn hộ Nguyễn Văn Linh"
            ],
            "responses": [
                "Phòng Căn hộ Nguyễn Văn Linh có các tiện ích: {bed=true, wardrobe=true, airConditioner=true, desk=true}, nội thất: {wifi=true, parking=true, elevator=true, security=true}"
            ]
        },
        {
            "tag": "Tiện ích phòng Nhà Sư Vạn Hạnh",
            "patterns": [
                "Cho tôi thông tin tiện ích của phòng Nhà Sư Vạn Hạnh",
                "Phòng Nhà Sư Vạn Hạnh có tiện ích gì?",
                "Tiện ích phòng Nhà Sư Vạn Hạnh"
            ],
            "responses": [
                "Phòng Nhà Sư Vạn Hạnh có các tiện ích: {bed=false, wardrobe=false, airConditioner=false, desk=false}, nội thất: {wifi=false, parking=true, elevator=false, security=true}"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ Bến Nghé",
            "patterns": [
                "Phòng Phòng trọ Bến Nghé có các loại phí gì?",
                "Cho tôi thông tin các loại phí của phòng Phòng trọ Bến Nghé",
                "Thông tin giá cả phòng Phòng trọ Bến Nghé"
            ],
            "responses": [
                "Phòng Phòng trọ Bến Nghé có các loại phí như sau: Phí nhà hàng tháng: 4.5E+9 VNĐ, Phí nước sinh hoạt: 100000000 VNĐ, Phí điện: 4000000 VNĐ, Các phí bổ sung: Loại phí: service, Số tiền: 200000 VNĐ",
                "Phòng Phòng trọ Bến Nghé có các loại phí như sau: Phí nhà hàng tháng: 4500000 VNĐ, Phí nước sinh hoạt: 100000 VNĐ, Phí điện: 4000 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 200000 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ Thảo Điền",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng trọ Thảo Điền",
                "Phòng Phòng trọ Thảo Điền có các loại phí gì?",
                "Thông tin giá cả phòng Phòng trọ Thảo Điền"
            ],
            "responses": [
                "Phòng Phòng trọ Thảo Điền có các loại phí như sau: Phí nhà hàng tháng: 5000000 VNĐ, Phí nước sinh hoạt: 120000 VNĐ, Phí điện: 3500 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 150000 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ Lê Văn Sỹ",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng trọ Lê Văn Sỹ",
                "Phòng Phòng trọ Lê Văn Sỹ có các loại phí gì?",
                "Thông tin giá cả phòng Phòng trọ Lê Văn Sỹ"
            ],
            "responses": [
                "Phòng Phòng trọ Lê Văn Sỹ có các loại phí như sau: Phí nhà hàng tháng: 4000000 VNĐ, Phí nước sinh hoạt: 100000 VNĐ, Phí điện: 4000 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 100000 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Căn hộ Nguyễn Huệ",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Căn hộ Nguyễn Huệ",
                "Phòng Căn hộ Nguyễn Huệ có các loại phí gì?",
                "Thông tin giá cả phòng Căn hộ Nguyễn Huệ"
            ],
            "responses": [
                "Phòng Căn hộ Nguyễn Huệ có các loại phí như sau: Phí nhà hàng tháng: 15000000 VNĐ, Phí nước sinh hoạt: 150000 VNĐ, Phí điện: 4000 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 500000 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Phòng trọ Trần Hưng Đạo",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Phòng trọ Trần Hưng Đạo",
                "Thông tin giá cả phòng Phòng trọ Trần Hưng Đạo",
                "Phòng Phòng trọ Trần Hưng Đạo có các loại phí gì?"
            ],
            "responses": [
                "Phòng Phòng trọ Trần Hưng Đạo có các loại phí như sau: Phí nhà hàng tháng: 2800000 VNĐ, Phí nước sinh hoạt: 80000 VNĐ, Phí điện: 3500 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 50000 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Căn hộ Nguyễn Văn Linh",
            "patterns": [
                "Phòng Căn hộ Nguyễn Văn Linh có các loại phí gì?",
                "Thông tin giá cả phòng Căn hộ Nguyễn Văn Linh",
                "Cho tôi thông tin các loại phí của phòng Căn hộ Nguyễn Văn Linh"
            ],
            "responses": [
                "Phòng Căn hộ Nguyễn Văn Linh có các loại phí như sau: Phí nhà hàng tháng: 8500000 VNĐ, Phí nước sinh hoạt: 120000 VNĐ, Phí điện: 4000 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 300000 VNĐ"
            ]
        },
        {
            "tag": "Chi tiết phí phòng Nhà Sư Vạn Hạnh",
            "patterns": [
                "Cho tôi thông tin các loại phí của phòng Nhà Sư Vạn Hạnh",
                "Phòng Nhà Sư Vạn Hạnh có các loại phí gì?",
                "Thông tin giá cả phòng Nhà Sư Vạn Hạnh"
            ],
            "responses": [
                "Phòng Nhà Sư Vạn Hạnh có các loại phí như sau: Phí nhà hàng tháng: 12000000 VNĐ, Phí nước sinh hoạt: 150000 VNĐ, Phí điện: 3500 VNĐ, Các phí bổ sung: Loại phí: null, Số tiền: 200000 VNĐ"
            ]
        }
    ]
}